testCases/counterflow_fgmFluid/0.orig/T
FoamFile { format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 1000;
boundaryField
{
    fuelInlet     { type fixedValue; value uniform 1000; }
    oxidizerInlet { type fixedValue; value uniform 1000; }
    upperOutflow  { type zeroGradient; }
    lowerOutflow  { type zeroGradient; }
    frontAndBack  { type empty; }
}
