testCases/counterflow_fgmFluid/0.orig/Z
FoamFile { format ascii; class volScalarField; object Z; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 0.5;
boundaryField
{
    fuelInlet     { type fixedValue; value uniform 1.0; }
    oxidizerInlet { type fixedValue; value uniform 0.0; }
    upperOutflow  { type zeroGradient; }
    lowerOutflow  { type zeroGradient; }
    frontAndBack  { type empty; }
}
