testCases/counterflow_fgmFluid/constant/fgmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| FGM 4-D (FPV + beta-PDF + chi_st) lookup table  --                          |
|     04_build_fgm_table_4d.py                                                |
| source: make_synthetic_fgm_4d.py                                    |
| P_ref = 1e+07 Pa                                                   |
| axes: Z~ (nZ=11), gZ (nGz=5), C~ (nC=11), chi_st (nChi=5)  [1/s]      |
| flat C-order:  idx = ((iZ*nGz + iGz)*nC + iC)*nChi + iChi                  |
| tabulated: sourcePV (omega_C), T, Y_<species>                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fgmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nZ      11;
nGz     5;
nC      11;
nChi    5;

Z
(
    0.00000000e+00
    1.00000000e-01
    2.00000000e-01
    3.00000000e-01
    4.00000000e-01
    5.00000000e-01
    6.00000000e-01
    7.00000000e-01
    8.00000000e-01
    9.00000000e-01
    1.00000000e+00
);

gZ
(
    0.00000000e+00
    2.25000000e-01
    4.50000000e-01
    6.75000000e-01
    9.00000000e-01
);

C
(
    0.00000000e+00
    3.00000000e-02
    6.00000000e-02
    9.00000000e-02
    1.20000000e-01
    1.50000000e-01
    1.80000000e-01
    2.10000000e-01
    2.40000000e-01
    2.70000000e-01
    3.00000000e-01
);

chi
(
    1.00000000e-01
    8.40896415e-01
    7.07106781e+00
    5.94603558e+01
    5.00000000e+02
);

sourcePV
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    1.65592098e+01
    1.65545937e+01
    1.62345844e+01
    6.85907672e+00
    1.63953228e-01
    2.62369992e+01
    2.62296853e+01
    2.57226511e+01
    1.08677644e+01
    2.59773309e-01
    2.90333682e+01
    2.90252748e+01
    2.84642004e+01
    1.20260630e+01
    2.87460241e-01
    2.49483168e+01
    2.49413622e+01
    2.44592320e+01
    1.03339725e+01
    2.47014026e-01
    1.39818451e+01
    1.39779474e+01
    1.37077461e+01
    5.79149302e+00
    1.38434663e-01
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    1.65592098e+01
    1.65545937e+01
    1.62345844e+01
    6.85907672e+00
    1.63953228e-01
    2.62369992e+01
    2.62296853e+01
    2.57226511e+01
    1.08677644e+01
    2.59773309e-01
    2.90333682e+01
    2.90252748e+01
    2.84642004e+01
    1.20260630e+01
    2.87460241e-01
    2.49483168e+01
    2.49413622e+01
    2.44592320e+01
    1.03339725e+01
    2.47014026e-01
    1.39818451e+01
    1.39779474e+01
    1.37077461e+01
    5.79149302e+00
    1.38434663e-01
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

T
(
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    4.77998568e+02
    4.77898771e+02
    4.70980392e+02
    2.68288455e+02
    1.23544554e+02
    8.35997136e+02
    8.35797542e+02
    8.21960784e+02
    4.16576911e+02
    1.27089109e+02
    1.19399570e+03
    1.19369631e+03
    1.17294118e+03
    5.64865366e+02
    1.30633663e+02
    1.55199427e+03
    1.55159508e+03
    1.52392157e+03
    7.13153821e+02
    1.34178218e+02
    1.90999284e+03
    1.90949385e+03
    1.87490196e+03
    8.61442277e+02
    1.37722772e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    1.20000000e+02
    4.77998568e+02
    4.77898771e+02
    4.70980392e+02
    2.68288455e+02
    1.23544554e+02
    8.35997136e+02
    8.35797542e+02
    8.21960784e+02
    4.16576911e+02
    1.27089109e+02
    1.19399570e+03
    1.19369631e+03
    1.17294118e+03
    5.64865366e+02
    1.30633663e+02
    1.55199427e+03
    1.55159508e+03
    1.52392157e+03
    7.13153821e+02
    1.34178218e+02
    1.90999284e+03
    1.90949385e+03
    1.87490196e+03
    8.61442277e+02
    1.37722772e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
    1.40603539e+02
    2.20094908e+03
    2.20036899e+03
    2.16015432e+03
    9.81960779e+02
...
);

species ( CO CO2 H2O KERO N2 O2 );

Y_CO
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    4.99998000e-03
    4.99858619e-03
    4.90196078e-03
    2.07106781e-03
    4.95049505e-05
    9.99996000e-03
    9.99717237e-03
    9.80392157e-03
    4.14213562e-03
    9.90099010e-05
    1.49999400e-02
    1.49957586e-02
    1.47058824e-02
    6.21320344e-03
    1.48514851e-04
    1.99999200e-02
    1.99943447e-02
    1.96078431e-02
    8.28427125e-03
    1.98019802e-04
    2.49999000e-02
    2.49929309e-02
    2.45098039e-02
    1.03553391e-02
    2.47524752e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    4.99998000e-03
    4.99858619e-03
    4.90196078e-03
    2.07106781e-03
    4.95049505e-05
    9.99996000e-03
    9.99717237e-03
    9.80392157e-03
    4.14213562e-03
    9.90099010e-05
    1.49999400e-02
    1.49957586e-02
    1.47058824e-02
    6.21320344e-03
    1.48514851e-04
    1.99999200e-02
    1.99943447e-02
    1.96078431e-02
    8.28427125e-03
    1.98019802e-04
    2.49999000e-02
    2.49929309e-02
    2.45098039e-02
    1.03553391e-02
    2.47524752e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
    2.87758920e-04
    2.90635346e-02
    2.90554328e-02
    2.84937754e-02
    1.20385584e-02
...
);

Y_CO2
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    3.99998400e-02
    3.99886895e-02
    3.92156863e-02
    1.65685425e-02
    3.96039604e-04
    7.99996800e-02
    7.99773790e-02
    7.84313725e-02
    3.31370850e-02
    7.92079208e-04
    1.19999520e-01
    1.19966068e-01
    1.17647059e-01
    4.97056275e-02
    1.18811881e-03
    1.59999360e-01
    1.59954758e-01
    1.56862745e-01
    6.62741700e-02
    1.58415842e-03
    1.99999200e-01
    1.99943447e-01
    1.96078431e-01
    8.28427125e-02
    1.98019802e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    3.99998400e-02
    3.99886895e-02
    3.92156863e-02
    1.65685425e-02
    3.96039604e-04
    7.99996800e-02
    7.99773790e-02
    7.84313725e-02
    3.31370850e-02
    7.92079208e-04
    1.19999520e-01
    1.19966068e-01
    1.17647059e-01
    4.97056275e-02
    1.18811881e-03
    1.59999360e-01
    1.59954758e-01
    1.56862745e-01
    6.62741700e-02
    1.58415842e-03
    1.99999200e-01
    1.99943447e-01
    1.96078431e-01
    8.28427125e-02
    1.98019802e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
...
);

Y_H2O
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    3.99998400e-02
    3.99886895e-02
    3.92156863e-02
    1.65685425e-02
    3.96039604e-04
    7.99996800e-02
    7.99773790e-02
    7.84313725e-02
    3.31370850e-02
    7.92079208e-04
    1.19999520e-01
    1.19966068e-01
    1.17647059e-01
    4.97056275e-02
    1.18811881e-03
    1.59999360e-01
    1.59954758e-01
    1.56862745e-01
    6.62741700e-02
    1.58415842e-03
    1.99999200e-01
    1.99943447e-01
    1.96078431e-01
    8.28427125e-02
    1.98019802e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    3.99998400e-02
    3.99886895e-02
    3.92156863e-02
    1.65685425e-02
    3.96039604e-04
    7.99996800e-02
    7.99773790e-02
    7.84313725e-02
    3.31370850e-02
    7.92079208e-04
    1.19999520e-01
    1.19966068e-01
    1.17647059e-01
    4.97056275e-02
    1.18811881e-03
    1.59999360e-01
    1.59954758e-01
    1.56862745e-01
    6.62741700e-02
    1.58415842e-03
    1.99999200e-01
    1.99943447e-01
    1.96078431e-01
    8.28427125e-02
    1.98019802e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
    2.30207136e-03
    2.32508277e-01
    2.32443462e-01
    2.27950203e-01
    9.63084670e-02
...
);

Y_KERO
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

Y_N2
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    8.70365380e-02
    8.70602328e-02
    8.87028647e-02
    1.36828045e-01
    1.71194614e-01
    1.74073076e-01
    1.74120466e-01
    1.77405729e-01
    2.73656090e-01
    3.42389228e-01
    2.61109614e-01
    2.61180699e-01
    2.66108594e-01
    4.10484136e-01
    5.13583842e-01
    3.48146152e-01
    3.48240931e-01
    3.54811459e-01
    5.47312181e-01
    6.84778455e-01
    4.35182690e-01
    4.35301164e-01
    4.43514323e-01
    6.84140226e-01
    8.55973069e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    8.70365380e-02
    8.70602328e-02
    8.87028647e-02
    1.36828045e-01
    1.71194614e-01
    1.74073076e-01
    1.74120466e-01
    1.77405729e-01
    2.73656090e-01
    3.42389228e-01
    2.61109614e-01
    2.61180699e-01
    2.66108594e-01
    4.10484136e-01
    5.13583842e-01
    3.48146152e-01
    3.48240931e-01
    3.54811459e-01
    5.47312181e-01
    6.84778455e-01
    4.35182690e-01
    4.35301164e-01
    4.43514323e-01
    6.84140226e-01
    8.55973069e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
    9.95108098e-01
    5.05919911e-01
    5.06057643e-01
    5.15605818e-01
    7.95344508e-01
...
);

Y_O2
(
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    1.00000000e+00
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    8.27963802e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    6.55927604e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    4.83891406e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    3.11855208e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    1.39819010e-01
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

// ************************************************************************* //
